// Дано 2809 секунд сколько это минут?
double numberA = 2809;
double numberB = 60;
Console.WriteLine(numberA / numberB);